---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSettings.GetDuctSettings(Autodesk.Revit.DB.Document)
source: html/80923557-908d-ce4b-b711-9134e567a658.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.GetDuctSettings Method

Get the duct settings of the project.

## Syntax (C#)
```csharp
public static DuctSettings GetDuctSettings(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The duct settings of the project.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null